spec/vcr/Payment_PaypalController/_callback/when_payment_is_approved/pays_the_order_and_redirect_to_finish_path.yml

---
http_interactions:
- request:
    method: post
    uri: https://ATqzAhBOpH7HX6JSJfd0iiLwxV-NY6Q_dkgPJ3vWiZjduwozYhZW6QKTGPdV:ECLwyBDuAXKH2uAy5thfqnJa2SsTtc5S208TWcvLbuK3xfD5r_O3OX8HY4PS@api.sandbox.paypal.com/v1/oauth2/token
    body:
      encoding: UTF-8
      string: grant_type=client_credentials
    headers:
      user-agent:
      - PayPalSDK/rest-sdk-ruby 0.7.0 (paypal-sdk-core 0.3.0; ruby 2.1.2p95-x86_64-darwin13.0)
      content-type:
      - application/x-www-form-urlencoded
      authorization:
      - Basic QVRxekFoQk9wSDdIWDZKU0pmZDBpaUx3eFYtTlk2UV9ka2dQSjN2V2laamR1d296WWhaVzZRS1RHUGRWOkVDTHd5QkR1QVhLSDJ1QXk1dGhmcW5KYTJTc1R0YzVTMjA4VFdjdkxidUszeGZENXJfTzNPWDhIWTRQUw==
      accept-encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      server:
      - Apache-Coyote/1.1
      proxy_server_info:
      - host=slcsbplatformapiserv3002.slc.paypal.com;threadId=207
      paypal-debug-id:
      - bfb715b681b93
      server_info:
      - identitysecuretokenserv:v1.oauth2.token&CalThreadId=31950&TopLevelTxnStartTime=14adcbb7d52&Host=slcsbidensectoken502.slc.paypal.com&pid=8111
      date:
      - Mon, 12 Jan 2015 06:01:22 GMT
      content-type:
      - application/json
      content-length:
      - '428'
    body:
      encoding: UTF-8
      string: '{"scope":"https://uri.paypal.com/services/subscriptions https://api.paypal.com/v1/payments/.*
        https://api.paypal.com/v1/vault/credit-card https://uri.paypal.com/services/applications/webhooks
        openid https://uri.paypal.com/services/invoicing https://api.paypal.com/v1/vault/credit-card/.*","access_token":"A015BPFOAxVou1f0ZPhqRSDLE7KnxyX4Q8CAJghH1k3IPxE","token_type":"Bearer","app_id":"APP-80W284485P519543T","expires_in":28800}'
    http_version: '1.1'
  recorded_at: Mon, 12 Jan 2015 06:01:22 GMT
- request:
    method: post
    uri: https://collector.newrelic.com/agent_listener/12//get_redirect_host?marshal_format=json
    body:
      encoding: UTF-8
      string: "[]"
    headers:
      content-encoding:
      - identity
      host:
      - collector.newrelic.com
      accept-encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      accept:
      - "*/*"
      user-agent:
      - NewRelic-RubyAgent/3.9.0.229 (ruby 2.1.2 x86_64-darwin13.0) zlib/1.2.8
      content-type:
      - application/octet-stream
  response:
    status:
      code: 200
      message: OK
    headers:
      content-type:
      - text/plain
      content-length:
      - '96'
      connection:
      - close
    body:
      encoding: UTF-8
      string: '{"exception":{"message":"Unknown license key","error_type":"NewRelic::Agent::LicenseException"}}'
    http_version: '1.1'
  recorded_at: Mon, 12 Jan 2015 06:01:24 GMT
- request:
    method: post
    uri: https://api.sandbox.paypal.com/v1/payments/payment
    body:
      encoding: UTF-8
      string: '{"intent":"sale","payer":{"payment_method":"paypal"},"transactions":[{"amount":{"currency":"USD","total":"99.90"}}],"redirect_urls":{"return_url":"http://test.host/zh-TW/payment/paypal/callback?order_no=151C000144TW","cancel_url":"http://test.host/zh-TW/cart"}}'
    headers:
      x-paypal-sandbox-email-address:
      - Platform.sdk.seller@gmail.com
      authorization:
      - Bearer A015BPFOAxVou1f0ZPhqRSDLE7KnxyX4Q8CAJghH1k3IPxE
      content-type:
      - application/json
      user-agent:
      - PayPalSDK/rest-sdk-ruby 0.7.0 (paypal-sdk-core 0.3.0; ruby 2.1.2p95-x86_64-darwin13.0)
      paypal-request-id:
      - 17002cdd-3939-4584-a76c-14924cddaa71
      accept-encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      server:
      - Apache-Coyote/1.1
      proxy_server_info:
      - host=slcsbplatformapiserv3001.slc.paypal.com;threadId=101483
      paypal-debug-id:
      - f69febac83dd3
      server_info:
      - paymentsplatformserv:v1.payments.payment&CalThreadId=1111&TopLevelTxnStartTime=14adcbb84c0&Host=slcsbpaymentsplatformserv3002.slc.paypal.com&pid=12904
      content-language:
      - "*"
      date:
      - Mon, 12 Jan 2015 06:01:24 GMT
      content-type:
      - application/json
      content-length:
      - '742'
    body:
      encoding: UTF-8
      string: '{"id":"PAY-29F22555YG7136239KSZWGNA","create_time":"2015-01-12T06:01:24Z","update_time":"2015-01-12T06:01:24Z","state":"created","intent":"sale","payer":{"payment_method":"paypal","payer_info":{"shipping_address":{}}},"transactions":[{"amount":{"total":"99.90","currency":"USD","details":{"subtotal":"99.90"}},"related_resources":[]}],"links":[{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-29F22555YG7136239KSZWGNA","rel":"self","method":"GET"},{"href":"https://www.sandbox.paypal.com/cgi-bin/webscr?cmd=_express-checkout&token=EC-147281373X502490R","rel":"approval_url","method":"REDIRECT"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-29F22555YG7136239KSZWGNA/execute","rel":"execute","method":"POST"}]}'
    http_version: '1.1'
  recorded_at: Mon, 12 Jan 2015 06:01:24 GMT
- request:
    method: get
    uri: https://api.sandbox.paypal.com/v1/payments/payment/PAY-29F22555YG7136239KSZWGNA
    body:
      encoding: US-ASCII
      string: ''
    headers:
      x-paypal-sandbox-email-address:
      - Platform.sdk.seller@gmail.com
      authorization:
      - Bearer A015BPFOAxVou1f0ZPhqRSDLE7KnxyX4Q8CAJghH1k3IPxE
      content-type:
      - application/json
      user-agent:
      - PayPalSDK/rest-sdk-ruby 0.7.0 (paypal-sdk-core 0.3.0; ruby 2.1.2p95-x86_64-darwin13.0)
      accept-encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      server:
      - Apache-Coyote/1.1
      proxy_server_info:
      - host=slcsbplatformapiserv3001.slc.paypal.com;threadId=448
      paypal-debug-id:
      - 3428a8308336a
      server_info:
      - paymentsplatformserv:v1.payments.payment&CalThreadId=1111&TopLevelTxnStartTime=14adcbb8af9&Host=slcsbpaymentsplatformserv3002.slc.paypal.com&pid=12904
      content-language:
      - "*"
      date:
      - Mon, 12 Jan 2015 06:01:26 GMT
      content-type:
      - application/json
      content-length:
      - '742'
    body:
      encoding: UTF-8
      string: '{"id":"PAY-29F22555YG7136239KSZWGNA","create_time":"2015-01-12T06:01:24Z","update_time":"2015-01-12T06:01:24Z","state":"created","intent":"sale","payer":{"payment_method":"paypal","payer_info":{"shipping_address":{}}},"transactions":[{"amount":{"total":"99.90","currency":"USD","details":{"subtotal":"99.90"}},"related_resources":[]}],"links":[{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-29F22555YG7136239KSZWGNA","rel":"self","method":"GET"},{"href":"https://www.sandbox.paypal.com/cgi-bin/webscr?cmd=_express-checkout&token=EC-147281373X502490R","rel":"approval_url","method":"REDIRECT"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-29F22555YG7136239KSZWGNA/execute","rel":"execute","method":"POST"}]}'
    http_version: '1.1'
  recorded_at: Mon, 12 Jan 2015 06:01:26 GMT
- request:
    method: post
    uri: https://api.sandbox.paypal.com/v1/payments/payment/PAY-29F22555YG7136239KSZWGNA/execute
    body:
      encoding: UTF-8
      string: '{"payer_id":"0"}'
    headers:
      x-paypal-sandbox-email-address:
      - Platform.sdk.seller@gmail.com
      authorization:
      - Bearer A015BPFOAxVou1f0ZPhqRSDLE7KnxyX4Q8CAJghH1k3IPxE
      content-type:
      - application/json
      user-agent:
      - PayPalSDK/rest-sdk-ruby 0.7.0 (paypal-sdk-core 0.3.0; ruby 2.1.2p95-x86_64-darwin13.0)
      paypal-request-id:
      - 48696aec-9bf6-4a45-84c3-b69ca74f8e61
      accept-encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      accept:
      - "*/*"
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      server:
      - Apache-Coyote/1.1
      proxy_server_info:
      - host=slcsbplatformapiserv3002.slc.paypal.com;threadId=82129
      paypal-debug-id:
      - 1137ad778f312
      server_info:
      - paymentsplatformserv:v1.payments.payment&CalThreadId=91&TopLevelTxnStartTime=14adcbb9644&Host=slcsbpaymentsplatformserv3001.slc.paypal.com&pid=16916
      content-language:
      - "*"
      date:
      - Mon, 12 Jan 2015 06:01:29 GMT
      connection:
      - close
      - close
      content-type:
      - application/json
      content-length:
      - '181'
    body:
      encoding: UTF-8
      string: '{"name":"INVALID_PAYER_ID","message":"Payer ID is invalid","information_link":"https://developer.paypal.com/webapps/developer/docs/api/#INVALID_PAYER_ID","debug_id":"1137ad778f312"}'
    http_version: '1.1'
  recorded_at: Mon, 12 Jan 2015 06:01:29 GMT
recorded_with: VCR 2.9.2
